benchmarks/results/ab-2026-09-06/baseline-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /?per=200
Document Length:        228528 bytes

Concurrency Level:      2
Time taken for tests:   1.998 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      45801600 bytes
HTML transferred:       45705600 bytes
Requests per second:    100.12 [#/sec] (mean)
Time per request:       19.976 [ms] (mean)
Time per request:       9.988 [ms] (mean, across all concurrent requests)
Transfer rate:          22391.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    11   20   3.0     19      33
Waiting:       11   20   3.0     19      33
Total:         11   20   3.0     19      34

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     19
  75%     20
  80%     20
  90%     23
  95%     27
  98%     31
  99%     33
 100%     34 (longest request)