benchmarks/results/ab-2026-09-06/baseline-4.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /?per=200
Document Length:        228528 bytes

Concurrency Level:      2
Time taken for tests:   1.955 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      45801600 bytes
HTML transferred:       45705600 bytes
Requests per second:    102.30 [#/sec] (mean)
Time per request:       19.550 [ms] (mean)
Time per request:       9.775 [ms] (mean, across all concurrent requests)
Transfer rate:          22878.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    10   19   1.3     19      24
Waiting:        9   19   1.3     19      24
Total:         10   19   1.3     19      24

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     20
  80%     20
  90%     21
  95%     21
  98%     23
  99%     23
 100%     24 (longest request)