benchmarks/results/ab-2026-09-06/bind_both-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /bind_both?per=200
Document Length:        228528 bytes

Concurrency Level:      2
Time taken for tests:   0.872 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      45801600 bytes
HTML transferred:       45705600 bytes
Requests per second:    229.40 [#/sec] (mean)
Time per request:       8.719 [ms] (mean)
Time per request:       4.359 [ms] (mean, across all concurrent requests)
Transfer rate:          51302.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     6    9   1.8      8      21
Waiting:        6    8   1.8      8      21
Total:          6    9   1.8      8      21

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%      9
  90%     10
  95%     11
  98%     15
  99%     19
 100%     21 (longest request)