benchmarks/results/ab-2026-09-06/bind_both-3.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /bind_both?per=200
Document Length:        228528 bytes

Concurrency Level:      2
Time taken for tests:   0.821 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      45801600 bytes
HTML transferred:       45705600 bytes
Requests per second:    243.75 [#/sec] (mean)
Time per request:       8.205 [ms] (mean)
Time per request:       4.103 [ms] (mean, across all concurrent requests)
Transfer rate:          54512.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     5    8   0.7      8      11
Waiting:        5    8   0.7      8      11
Total:          5    8   0.7      8      11

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      8
  75%      8
  80%      9
  90%      9
  95%      9
  98%     10
  99%     11
 100%     11 (longest request)