benchmarks/results/ab-2026-09-06/bind_both-5.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /bind_both?per=200
Document Length:        228528 bytes

Concurrency Level:      2
Time taken for tests:   0.920 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      45801600 bytes
HTML transferred:       45705600 bytes
Requests per second:    217.46 [#/sec] (mean)
Time per request:       9.197 [ms] (mean)
Time per request:       4.598 [ms] (mean, across all concurrent requests)
Transfer rate:          48633.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     5    9   1.8      9      18
Waiting:        5    9   1.8      8      18
Total:          5    9   1.8      9      19

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%     10
  90%     11
  95%     14
  98%     16
  99%     17
 100%     19 (longest request)